answer = input('Введите строку ')

b1 = ['ц','к','н','г', 'ш','щ','з','х','ф','в','п','р','л','д','ж','ч','с','м','т','б']

a1 = ['у','е','ы','а','о','э','я','и','ю']

punkt = [',','.','-','!','?']

integers = ['1','2','3','4','5','6','7','8','9','0']

final = {
    'гласные': 0,
    'согласные': 0,     
    'пунктуация': 0,
    'цифры': 0
         }

for i in answer:
    if i in b1:
        final['согласные'] += 1
    if i in a1:
        final['гласные'] += 1
    if i in punkt:
        final['пунктуация'] += 1
    if i in integers:
        final['цифры'] += 1

print(final)